using System;
using System.Collections.Generic;
using System.Linq;
using System.Text;
using System.Threading.Tasks;

namespace Hillel_HW._5_Events__lambda__Extension_Methods
{
    internal class SubProgram
    {
//        Опис: Створіть консольну програму, яка використовує всі три теми разом.
//Вимоги:

//Створіть клас Sensor, який міститиме масив вимірювань (типу double) та подію MeasurementUpdated.
//Реалізуйте метод AddMeasurement, який додаватиме нове значення у масив вимірювань, а також викликатиме подію MeasurementUpdated із середнім значенням масиву як параметром.
//Використайте метод розширення для обчислення середнього значення масиву вимірювань у момент виклику події.
//Створіть програму, яка підписується на подію MeasurementUpdated і виводить середнє значення кожного разу, коли додається нове вимірювання.
//Для фільтрації вимірювань, які будуть додаватися, використайте лямбда вирази(наприклад, додавати тільки позитивні значення).


    }
}
